package com.example.withallah.java.withallah

import android.content.Intent
import android.os.Bundle
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.fragment.app.Fragment
import com.example.withallah.R
import kotlinx.android.synthetic.main.fragment_doaa.*

class DoaaFragment : Fragment() {
    override fun onCreateView(inflater: LayoutInflater, container: ViewGroup?, savedInstanceState: Bundle?): View? {
       val q= inflater.inflate(R.layout.fragment_doaa, container, false)
        return q;
    } //end onCReateView

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)
        var int=  Intent(activity,doaa_source::class.java)

        adyaa_mnwaa.setOnClickListener {
            int.putExtra("doaa","- دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ:\n" +
                    "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا. \n\n" +
                    "- دُعَاءُ دُخُولِ المَسْجِدِ:\n" +
                    "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:\n" +
                    "أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك. \n\n" +
                    "- دُعَاءُ الخُرُوجِ مِنَ المَسْجِد:ِ\n" +
                    "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:\n" +
                    "بِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم. \n\n" +
                    "_______________________________________\n\n" +
                    "- أدعية للمتوفى (ذكور):\n" +
                    "\n" +
                    "1- { اللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار } .\n\n" +
                    "2- { اللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله }.\n\n" +
                    "3- { اللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً } .\n\n" +
                    "4- { اللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته } .\n\n" +
                    "5- { اللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب } .\n\n" +
                    "6- { اللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته } .\n\n" +
                    "7- { اللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين } .\n\n" +
                    "8- { اللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً } .\n\n" +
                    "9-{ اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار } .\n\n" +
                    "10- { اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة } .\n\n" +
                    "11- { اللَّهُمَّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها } .\n\n" +
                    "12- { اللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور } .\n\n" +
                    "13- اللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم } .\n\n" +
                    "14- { اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه } .\n\n" +
                    "15- { اللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به } .\n\n" +
                    "16- { اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال } .\n\n" +
                    "17- { اللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه } .\n\n" +
                    "18- { اللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين } .\n\n" +
                    "19- { اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود } .\n\n" +
                    "20- { اللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون \"يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\" } . \n\n" +
                    "21- { اللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم) } .\n\n" +
                    "22- { اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته } .\n\n" +
                    "23- { اللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق } .\n\n" +
                    "24- { اللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك } .\n\n" +
                    "25- { اللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً } .\n\n" +
                    "26-{ اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم } .\n\n" +
                    "27- { اللَّهُمَّ اعف عنه فإنّك القائل \"ويعفو عن كثير\" } . \n\n" +
                    "28- { اللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فَجد عليه بعفوك وإكرامك وجود إحسانك } .\n\n" +
                    "29- { اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه } .\n\n" +
                    "30- { اللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً } .\n\n" +
                    "31- { اللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين } .\n\n" +
                    "32- { اللَّهُمَّ بشّره بقولك \"كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\" } .\n\n" +
                    "33- { اللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض } .\n\n" +
                    "34- { اللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: \"ولمن خاف مقام ربّه جنّتان\" } .\n\n" +
                    "35- { اللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً } .\n\n" +
                    "36- { اللَّهُمَّ اجعله في جنّة الخلد \"الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\" } .\n\n" +
                    "37- { اللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل \"إنّما يوفي الصّابرون أجرهم بغير حساب\" } . \n\n" +
                    "38- { اللَّهُمَّ إنّه كان مصلّ لك، فثبّته على الصّراط يوم تزل الأقدام } .\n\n" +
                    "39- { اللَّهُمَّ إنّه كان صائماً لك، فأدخله الجنّة من باب الريّان } .\n\n" +
                    "40- { اللَّهُمَّ إنّه كان لكتابك تالٍ وسامع، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه } .\n\n" +
                    "41- { اللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء } .\n\n" +
                    "42- { اللَّهُمَّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً } .\n\n" +
                    "43- { اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا } .\n\n" +
                    "44- { اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان } .\n\n" +
                    "45- { اللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده } .\n\n" +
                    "46- { اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين } .\n\n" +
                    "47- { اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب } .\n\n" +
                    "48- { اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات } .\n\n" +
                    "49- { اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق } .\n\n" +
                    "50- { اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب } .\n\n" +
                    "51- { اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم } .\n\n" +
                    "52- { اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال } .\n\n" +
                    "53- { اللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا } .\n\n" +
                    "54- { اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام } .\n\n" +
                    "55- {اللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار } .\n\n" +
                    "56- { اللَّهُمَّ لا تحرمنا أجره، ولا تفتنّا بعده، واغفر لنا وله، واجمعنا معه في جنّات النّعيم يا ربّ العالمين } .\n\n" +
                    "57- { اللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك } .\n\n" +
                    "58- { اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد } .\n\n" +
                    "59- { اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين } .\n\n" +
                    "_______________________________________\n\n" +
                    "- أدعية للمتوفية (إناث):\n" +
                    "\n" +
                    "1- { اللَّهُمَّ أبدلها داراً خيراً من دارها، وأهلاً خيراً من أهلها، وأدخلها الجنّة، وأعذها من عذاب القبر ومن عذاب النّار } .\n\n" +
                    "2- { اللَّهُمَّ عاملها بما أنت أهله، ولا تعاملها بما هى أهله } .\n\n" +
                    "3- { اللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً } .\n\n" +
                    "4- { اللَّهُمَّ إن كانت محسنةً فزد من حسناتها، وإن كان مسيئةً فتجاوز عن سيّئاتها } .\n\n" +
                    "5- { اللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب } .\n\n" +
                    "6- { اللَّهُمَّ اّنسها في وحدتها وفي وحشتها وفي غربتها } .\n\n" +
                    "7- { اللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين } .\n\n" +
                    "8- { اللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً } .\n\n" +
                    "9- { اللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار } .\n\n" +
                    "10- { اللَّهُمَّ افسح لها في قبرها مدّ بصرها، وافرش قبرها من فراش الجنّة } .\n\n" +
                    "11- { اللَّهُمَّ أعذها من عذاب القبر، وجفاف ِالأرض عن جنبيها } .\n\n" +
                    "12- { اللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور } .\n\n" +
                    "13- { اللَّهُمَّ إنّها في ذمّتك وحبل جوارك، فقِهِا فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر لهه وارحمها إنّك أنت الغفور الرّحيم } .\n\n" +
                    "14- { اللَّهُمَّ إنها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هى لاقته } .\n\n" +
                    "15- { اللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به } .\n\n" +
                    "16- { اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمها ولا تعذّبها، وأن تثبّتها عند السؤال } .\n\n" +
                    "17- { اللَّهُمَّ إنّها نَزَلت بك وأنت خير منزولٍ به، وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها } .\n\n" +
                    "18- { اللَّهُمَّ آتها برحمتك ورضاك، وقهِا فتنة القبر وعذابه، وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين } .\n\n" +
                    "19- { اللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود } .\n\n" +
                    "20- { اللَّهُمَّ احمها تحت الأرض، واسترها يوم العرض، ولا تخزها يوم يبعثون “يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم” } .\n\n" +
                    "21- { اللَّهُمَّ يمّن كتابها، ويسّر حسابها، وثقّل بالحسنات ميزانها، وثبّت على الصّراط أقدامها، وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم) } .\n\n" +
                    "22- { اللَّهُمَّ أمّنها من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسها آمنة مطمئنّة، ولقّنها حجّتها } .\n\n" +
                    "23- { اللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الإشهاد آمنةً، وبجود رضوانك واثقةً، وإلى أعلى درجاتك سابقةً } .\n\n" +
                    "24- { اللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك } .\n\n" +
                    "25- { اللَّهُمَّ انظر إليها نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً } .\n\n" +
                    "26- { اللَّهُمَّ أسكنها فسيح الجنان، واغفر لها يا رحمن، وارحمها يا رحيم، وتجاوز عمّا تعلم يا عليم } .\n\n" +
                    "27- { اللَّهُمَّ اعف عنها فإنّك القائل “ويعفو عن كثير” } .\n\n" +
                    "28- { اللَّهُمَّ إنّها جاءت ببابك، وأناخت بجنابك، فَجد عليها بعفوك وإكرامك وجود إحسانك } .\n\n" +
                    "29- { اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها، وتقرّ بها عينها } .\n\n" +
                    "30- { اللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً } .\n\n" +
                    "31- { اللَّهُمَّ احشرها مع أصحاب اليمين، واجعل تحيّتها سلامٌ لك من أصحاب اليمين } .\n\n" +
                    "32- { اللَّهُمَّ بشّرها بقولك “كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية } \n\n" +
                    "33- { اللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض } .\n\n" +
                    "34- { اللَّهُمَّ لا نزكّيها عليك، ولكنّا نحسبها أنّها أمنت وعملت صالحاً، فاجعل لها جنّتين ذواتي أفنان بحقّ قولك: “ولمن خاف مقام ربّه جنّتان” } .\n\n" +
                    "35- { اللَّهُمَّ شفع فيها نبيّنا ومصطفاك، واحشرها تحت لوائه، واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً } .\n\n" +
                    "36- { اللَّهُمَّ اجعلها في جنّة الخلد \"الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\" } .\n\n" +
                    "37- { اللَّهُمَّ إنّها صبرت على البلاء فلم تجزع، فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل \"إنّما يوفي الصّابرون أجرهم بغير حساب\" } .\n\n" +
                    "38- { اللَّهُمَّ إنّها كانت تصلّى لك، فثبّتها على الصّراط يوم تزل الأقدام } .\n\n" +
                    "39- { اللَّهُمَّ إنّها كانت صائمةً لك، فأدخلها الجنّة من باب الريّان } .\n\n" +
                    "40- { اللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً، فشفّع فيها القرآن، وارحمها من النّيران، واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأتها أو سمعتها، وآخر حرفٍ تلته } .\n\n" +
                    "41- { اللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء } .\n\n" +
                    "42- { اللَّهُمَّ ارحمها فإنّها كان مسلمةً، واغفر لها فإنّها كان مؤمنةً، وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقةً، وسامحها فإنّها كانت لكتابك مرتّلةً } .\n\n" +
                    "43- { اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا } .\n\n" +
                    "44- { اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان } .\n\n" +
                    "45- { اللَّهُمَّ لا تحرمنا أجرها ولا تضللنا بعدها } .\n\n" +
                    "46- { اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين } .\n\n" +
                    "47- { اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب } .\n\n" +
                    "48- { اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات } .\n\n" +
                    "49- { اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق } .\n\n" +
                    "50- { اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب } .\n\n" +
                    "51- { اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم } .\n\n" +
                    "52- { اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال } .\n\n" +
                    "53- { اللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا } .\n\n" +
                    "54- { اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام } .\n\n" +
                    "55- { اللَّهُمَّ إنّها امتك بنت أمتك ماتت وهى تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار } .\n\n" +
                    "56- { اللَّهُمَّ لا تحرمنا أجرها، ولا تفتنّا بعدها، واغفر لنا ولها، واجمعنا معها في جنّات النّعيم يا ربّ العالمين } .\n\n" +
                    "57- { اللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك } .\n\n" +
                    "58- { اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد } .\n\n" +
                    "59- { اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين } .\n\n" +
                    "_______________________________________\n\n" +
                    "- أدعية للميّت الطفل الصغير (ذكر أو أنثى):\n" +
                    "\n" +
                    "{ اللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوَالِدَيْهِ، وشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وأعْظِمْ بهِ أُجُورَهُمَا، وألْحِقْهُ بِصَالِحِ الـمُؤْمِنينَ، واجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الجَحِيمِ، وأبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لأسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنا بالإيْمَانِ } .\n\n" +
                    "_______________________________________\n\n" +
                    "- الدّعاء للميّت في صّلاة الجنازة:\n" +
                    "\n" +
                    "{ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ ، وَأَكْرِمْ نُزُلَهُ ، وَوَسِّعْ مُدْخَلَهُ ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ ، وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ ، وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ ، وَأَدْخِلْهُ الْجَنَّةَ ، وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ } .\n\n" +
                    "_______________________________________\n\n" +
                    "- دعاء سيد الاستغفار:\n" +
                    "{ اللَّهمَّ أنتَ ربِي، لَا إلهَ إلَّا أنتَ، خلَقْتَني وأَنَا عبدُكَ، وأنا علَى عَهْدِكَ وَوَعْدِكَ ما استطعتُ\n" +
                    "أعوذُ بِكُ مِنْ شَرِّ ما صنعْتُ، أبوءُ لكَ بنعمتِكَ عَلَيَّ، وأبوءُ لَكَ بذنبي، فاغفرْ لِي، فَإِنَّه لَا يغفرُ الذنوبَ إلَّا أَنْتَ }\n" +
                    "\n" +
                    "- الأوقات المستحبة لدعاء سيد الاستغفار:\n" +
                    "من الجائز أن يردّد المسلم سيد الاستغفار في كل وقت وفي أي حال\n" +
                    "لكنّ النّبيّ -صلّى الله عليه وسلّم- خصّ أوقاتاً معيّنة مسّتحبة ليردد المسلم سيد الاستغفار\n" +
                    "منها: أدبار الصّلاة المكتوبة، و كذكر من أذكار الصباح والمساء ." +
                    "\n\n\n")

            startActivity (int)
        }

        doaa_qlq.setOnClickListener {
            int.putExtra("doaa","- إن القلق والخوف من أهم الأمور التي تشغلنا دائماً، فالقلق والخوف ظاهرتين تحدث لنا في جوانب حياتية عديدة بشأن المستقبل، إلا أنه من المهم ان ندعو الله تعالى لكي يطمئننا عن الحياة المستقبلية ونبتعد عن هذه الهواجس التي تشغلنا، فهو سبحانه من بيده المستقبل، بذبك لابد من إحسان الطلب للقضاء على خوفنا وقلقنا، وهذا يتم من خلال الدعاء والتضرع لله وهذا ما نعرفه من خلال الأدعية التالية من أدعية القلق والخوف:\n" +
                    "\n" +
                    "1- { اللهم إنّي أسالك موجبات رحمتك، وعزائم مغفرتك، والغنيمة من كلّ بر، والسّلامة من كلّ إثم، والفوز بالجنّة، والنّجاة من النّار، اللهم لا تدع لي ذنباً إلّا غفرته، ولا همّاً إلّا فرّجته، ولا حاجةً من حوائج الدنيا هي لك رضىً إلّا قضيتها، برحمتك يا أرحم الرّاحمين } .\n\n" +

                    "2- { ربّي لا تكلني إلى أحد، ولا تحوجني إلى أحد، وأغنني عن كلّ أحد، يا من إليه المستند، وعليه المعتمد، وهو الواحد الفرد الصّمد، لا شريك له ولا ولد، خذ بيدي من الضلال إلى الرّشد، ونجّني من كل ضيقٍ ونكد } .\n\n" +

                    "3- { ربّنا أفرغ علينا صبراً وتوفّنا مسلمين وألحقنا بالصّالحين وأفوّض أمري إلى الله، إنّ الله بصير بالعباد وحسبنا الله ونعم الوكيل، ولا حول ولا قوّة إلّا بالله العليّ العظيم، وصلّى الله على سيّدنا محمّد الحبيب وعلى آله وصحبه وسلّم } .\n\n" +

                    "4- { اللهمّ إنّي أسألك باسمك العظيم الأعظم الّذي إذا دعيت به أجبت وإذا سألت به أعطيت، وإذا استرحمت به رحمت، وإذا استفرجت به فرجت أن تفرّج عنّي ما أنا فيه وأن تكفيني شرّ الحاسدين والمعادين، وانصرني عليهم بنصرك وتأييدك يا قويّ يا معين } .\n\n" +

                    "5- { اللهم احرسني بعينيك التي لا تنام، واكفني بركنك الذي لا يرام، واحفظني بعزك الذي لا يُضام، واكلأه في الليل وفي النهار، وارحمني بقدرتك عليّ، أنت ثقتي ورجائي يا كاشف الهم، ويا مُفرج الكرب يا مُجيب دعوة المُضطرين } .\n\n" +

                    "6- { اللهمّ ربّ السموات السبع وما أظلّت، وربّ الأرضين وما أقلّت، وربّ الشياطين وما أضلّت، كن لي جاراً من شرّ خلقك كلّهم جميعاً أن يفرط عليّ أحد وأن يبغي عليّ عزّ جارك، وجلّ ثناؤك، ولا إله غيرك، ولا إله إلّا أنت } .\n\n" +

                    "7- { اللهم بك أستعين وعليك أتوكل، اللهم ذلل لي صعوبة أمري، وسهل لي مشقته، وارزقني الخير كله أكثر مما أطلب، واصرف عني كل شر رب اشرح لي صدري ويسر لي أمري يا كريم } .\n\n" +

                    "8- { اللهم إني أسألك يا من لا تغلطه المسائل، يا من لا يشغله سمع عن سمع، يا من لا يبرمه إلحاح الملحين، اللهم إني أعوذ بك من جهد البلاء ودرك الشقاء، وسوء القضاء، وشماتة الأعداء، اللهم اكشف عني وعن كل المسلمين كل شدة وضيق وكرب، اللهم أسألك فرجًا قريبًا، وكف عني ما أطيق، وما لا أطيق، اللهم فرج عني وعن كل المسلمين كل هم وغم، وأخرجني والمسلمين من كل كرب وحزن } .\n\n" +

                    "9- { أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه عدد خلقه، ورضى نفسه، وزنة عرشه، ومداد كلماته، اللهم إني أسألك من خير ما سألك منه نبيك محمد، وأعوذ بك من شر ما استعاذ منه نبيّك محمّد } .\n\n" +

                    "10- { يا حي يا قيوم، يا نور يا قدوس، يا حي يا الله، يا رحمن اغفر لي الذنوب التي تحل النقم، واغفر لي الذنوب التي تُورث الندم، واغفر لي الذنوب التي تحبس القِسم، واغفر لي الذنوب التي تهتِك العِصم، واغفر لي الذنوب التي تقطع الرجاء، واغفر لي الذنوب التي تُعجّل الفناء، واغفر لي الذنوب التي ترد الدعاء، واغفر لي الذنوب التي تمسك غيث السماء، واغفر لي الذنوب التي تُظلم الهواء، واغفر لي الذنوب التي تكشِف الغِطاء، اللهم إني أسألك، يا فارج الهم، يا كاشف الغم، مجيب دعوة المضطر، رحمن الدنيا والآخرة ورحيمها، أسألك أن ترحمني برحمةٍ من عندك تُغنني بها عن رحمة من سواك } .\n\n" +

                    "11- { يا لطيف، يا لطيف، يا لطيف، الطف بِي بلطفك الخفي، واعني بقدرتك، اللهم إني أنتظر فرجك، وأرقب لُطفك، فالطف بي، ولا تكلني، إلى نفسي ولا إلى غيرك، لا إله إلا الله الرحمن الرحيم، اللهم إني أنزلتُ بك حاجتي كُلها، الظاهرة والباطنة } .\n\n" +

                    "12- { اللهمَّ مالِكَ المُلْكِ تؤتي المُلكَ مَن تشاءُ وتنزِعُ المُلْكَ ممَّن تشاءُ وتُعِزُّ مَن تشاءُ وتُذِلُّ مَن تشاءُ بيدِك الخيرُ إنَّك على كلِّ شيءٍ قديرٌ تولِجُ اللَّيلَ في النَّهارِ وتولِجُ النَّهارَ في اللَّيلِ وتُخْرِجُ الحيَّ مِنَ الميَّتِ وتُخْرِجُ الميَّتَ مِنَ الحيِّ وترزُقُ مَن تشاءُ بغيرِ حسابٍ رحمنُ الدُّنيا والآخرةِ ورحيمُهما تُعطي منهما مَن تشاءُ وتمنَعُ مَن تشاءُ ارحَمْني رحمةً تُغْنيني بها عن رحمةِ مَن سِواك } .\n\n" +

                    "13- { اللَّهمَّ إنِّي عبدُك، ابنُ عبدِك، ابنُ أمَتِك، ناصيتي بيدِك ، ماضٍ فيَّ حكمُك، عدْلٌ فيَّ قضاؤُك، أسألُك بكلِّ اسمٍ هو لك سمَّيْتَ به نفسَك، أو علَّمْتَه أحدًا من خلقِك، أو أنزلتَه في كتابِك، أو استأثرت به في علمِ الغيبِ عندك، أن تجعلَ القرآنَ ربيعَ قلبي، ونورَ صدري، وجلاءَ حَزَني، وذهابَ همِّي } .\n\n" +

                    "14- { لا إلهَ إلا اللهُ ربُّ العرشِ العظيمِ الكريمِ لا إلهَ إلا اللهُ العظيمُ الحليمُ لا إلهَ إلا اللهُ ربُّ السمواتِ وربُّ الأرضِ ربُّ العرشِ العظيمِ لا إلهَ إلا اللهُ ربُّ العرشِ الكريمِ لا إلهِ إلا اللهُ ربُّ السمواتِ وربُّ الأرضِ ربُّ العرشِ الكريمِ } .\n\n" +

                    "15- { الإكثار من الصلاة على النبي صلّى الله عليه وسلّم، فقد روي عن أبي بن كعب قال، قلت: (يا رسولَ اللهِ إِنَّي أُكْثِرُ الصلاةَ عليْكَ فكم أجعَلُ لكَ من صلاتِي فقال ما شِئْتَ قال قلتُ الربعَ قال ما شئْتَ فإِنْ زدتَّ فهو خيرٌ لكَ قلتُ النصفَ قال ما شئتَ فإِنْ زدتَّ فهو خيرٌ لكَ قال قلْتُ فالثلثينِ قال ما شئْتَ فإِنْ زدتَّ فهو خيرٌ لكَ قلتُ أجعلُ لكَ صلاتي كلَّها قال: إذًا تُكْفَى همَّكَ ويغفرْ لكَ ذنبُكَ) } .\n\n" +

                    "16- { اللَّهمَّ ربَّ السَّمواتِ السَّبعِ وربَّ العرشِ العظيمِ ربَّنا وربَّ كلِّ شيءٍ أنتَ الظَّاهرُ فليس فوقَكَ شيءٌ وأنتَ الباطنُ فليس دونَكَ شيءٌ مُنزِلَ التَّوراةِ والإنجيلِ والفُرقانِ فالقَ الحَبِّ والنَّوى أعوذُ بكَ مِن شرِّ كلِّ شيءٍ أنتَ آخِذٌ بناصيتِه أنتَ الأوَّلُ فليس قبْلَكَ شيءٌ وأنتَ الآخِرُ فليس بعدَكَ شيءٌ اقضِ عنَّا الدَّينَ وأَغْنِنا مِن الفقرِ } .\n\n" +

                    "17- { اللهم إن ضرورتنا قد حَفت، وليس لها إلا أنت، فاكشفها، يا مفرج الهموم، لا إله إلا أنت سبحانك، إني كنت من الظالمين، اللهم اكفني ما أهمني، اللهم يا حابس يد إبراهيم عن ذبح ابنه، يا رافع شأن يوسف على أخوته وأهله } .\n\n" +

                    "18- { يا ودود، يا ودود، يا ودود، يا ذا العرشِ المجيد، يا مُبدئ يا معيد، يا فعال لما يريد، أسألك بنور وجهك الذي ملأ أركان عرشك، وأسألك بقدرتك التي قدرت بها على جميع خلقك، وأسألك برحمتك التي وسعت كل شيء، لا إله إلا أنت، يا مُغيث أغثني } .\n\n" +

                    "19- { اللهم اكشف عني كل بلوى، يا عالِم كل خفية، يا صارف كل بليّة، أغثني، أدعوك دعاء من اشتدت به فاقته، وضعُفت قوته، وقلت حيلته، دعاء الغريق المضطر، اللهم ارحمني و أغثني، والطف بي، و تداركني بإغاثتك، اللهم بك ملاذي، اللهم أتوسل إليك باسمك الواحد، والفرد الصمد، وباسمك العظيم فرج عني ما أمسيت فيه، وأصبحت فيه، حتى لا يخامر خاطري وأوهامي غبار الخوف من غيرك، ولا يشغلني أثر الرجاء من سواك، أجرني، أجرني، أجرني، يا الله، اللهم يا كاشف الغم والهموم، ومفرج الكرب العظيم، ويا من إذا أراد شيئًا يقول له: كُن فيكون، رباه رباه أحاطت بي الذنوب والمعاصي، فلا أجد الرحمة والعناية من غيرك، فأمدني بها } .\n\n" +

                    "20- { اللهم اكفني ما أهمني، وما لا أهتم له، اللهم زودني بالتقوى، واغفر لي ذنبي، ووجهني للخير أينما توجهت، اللهم يسرني لليسرى، وجنبني العسرى، اللهم اجعل لي من كل ما أهمني و كربني سواء من أمر دنياي وآخرتي فرجًا ومخرجًا، وارزقني من حيث لا أحتسب، واغفر لي ذنوبي، وثبت رجاك في قلبي، و اقطعه ممن سِواك، حتى لا أرجو أحدًا غيرك، يا من يكتفي من خلقه جميعًا، ولا يكتفي منه أحد من خلقه، يا أحد، من لا أحد له انقطع الرجاء إلا منك } .\n\n" +

                    "21- { اللهم إني أسألك سلامًا ما بعده كدر، ورضى ما بعده سخط، وفرحًا ما بعده حزن، اللهم املأ قلبي بكلّ ما فيه الخير لي، اللهم اجعل طريقي مسهلًا وأيامي القادمة أفضل من سابقاتها } .\n\n" +

                    "22- { أغثني، أغثني، يا عزيز يا حميد، يا ذا العرش المجيد، اصرف عني شر كل جبار عنيد، اللهم إنك تعلم أنني على إساءتي وظلمي وإسرافي لم أجعل لك ولدًا ولا ندًا، ولا صاحبة ولا كفوًا أحد، فإن تُعذب فأنا عبدك، وإن تغفر فإنك العزيز الحكيم } .\n\n" +

                    "- هذه كانت أدعية من السنة النبوية والأدعية المأثورة لتفريج الهم والغم والاطمئنان من القلق والخوف في الحياة ." +
                    "\n\n\n")

           startActivity(int)
        }

        doaa_eat.setOnClickListener {
            int.putExtra("doaa","- الدُّعَاءُ قَبْلَ الطَّعَامِ:\n" +
                    "1- { إِذَا أَكَلَ أَحَدُكُمْ طَعَاماً فَلْيَقُلْ بِسْمِ اللَّهِ، فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ بسمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ } .\n" +
                    "\n" +
                    "2- { مَنْ أَطْعَمَهُ اللَّهُ الطَّعَامَ فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ، وَمَنْ سَقَاهُ اللَّهُ لَبَناً فَلْيَقُلْ اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ } .\n" +
                    "________________________________________\n" +
                    "\n" +
                    "- الدُّعَاءُ عِنْدَ الْفَرَاغِ مِنَ الطَّعَامِ:\n" +
                    "3- { الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ } .\n" +
                    "\n" +
                    "4- { الْحَمْدُ لِلَّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، غَيْرَ مَكْفِيٍّ وَلاَ مُوَدَّعٍ، وَلاَ مُسْتَغْنَىً عَنْهُ رَبَّنَا } .\n" +
                    "_______________________________________\n" +

                    "\n" +
                    "- ماذا يفعل من نسي التسمية قبل البدء في تناول الطعام ..؟ \n\n" +
                    "- لمن نسى أن يسمي الله قبل أن يبدأ في تناول الطعام يقول بسم الله في أوله و آخره ( قال رسول الله صلى الله عليه و سلم إذا أكل أحدكم طعاماً فليقل : بسم الله ، فإن نسي في أوله فليقل : بسم الله في أوله و أخره” صدق رسول الله صلى الله عليه و سلم ." +
                    "\n\n\n")


            startActivity(int)
        }
        doaa_sick.setOnClickListener {
            int.putExtra("doaa","- دعاء للمريض بالشفاء، الإنسان دائما معرض للابتلاء سواء بالمرض او فقدان شيء أو بالإخفاق في العمل أو ضيق الرزق والابتلاءات كثيرة ومتعددة وهي بمثابة اختبار من الله لقوة إيمان العبد، تعتبر زيارة المريض من أحب الأعمال عند الله تعالى ولها ثواب عظيم، كما أن الـ دعاء للمريض له ثواب كبير عند الله تعالى ويعود على صاحبه بفوائد كثيرة. والـ دعاء للمريض ليس فقط من أسباب الشفاء فيوجد آيات من القرآن الكريم لها أثر كبير في شفاء المريض.\n\n" +

                    "1- { أَذْهِبِ البَاسَ، رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إلَّا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا } .\n\n" +
                    "2- { اللهمَّ عافِني في بدني، اللهمَّ عافِني في سمعي، اللهمَّ عافِني في بصري } .\n\n" +
                    "3- { بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولَا في السَّماءِ، وَهوَ السَّميعُ العليمُ ثلاثَ مرَّاتٍ } .\n\n" +
                    "4- { ربَّنا اللهُ الذي في السَّماءِ تقدَّس اسمُك أمرُك في السَّماءِ والأرضِ كما رحمتُك في السَّماءِ فاجعلْ رحمتَكَ في الأرضِ اغفرْ لنا حُوبَنا وخطايانا أنت ربُّ الطَّيِّبينَ أنزِلْ رحمةً وشفاءً من شفائِك على هذا الوجعِ فيبرأُ } .\n\n" +
                    "5- { قراءة سورة الفاتحة على المريض: بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ* (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ* الرَّحْمَٰنِ الرَّحِيمِ* مَالِكِ يَوْمِ الدِّينِ* إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ* اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ* صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ) } .\n\n" +
                    "6- { قراءة المعوذتين على المريض وهما: سورة الفلق (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ) وسورة الناس: (قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَٰهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ) } .\n\n" +
                    "قراءة سورة الإخلاص: (قُلْ هُوَ اللَّهُ أَحَدٌ* اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ) } .\n\n" +
                    "7- { قراءة آية الكرسي: اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ } .\n\n" +
                    "8- { قراءة أواخر سورة البقرة: آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ } .\n\n" +
                    "9- { اللهم إنا نسألك بأسمائك الحسنى وصفاتك العلا وبرحمتك التي وسعت كلّ شيء، أن تمنّ علينا بالشفاء العاجل، وألّا تدع فينا جرحاً إلّا داويته، ولا ألماً إلا سكنته، ولا مرضاً إلا شفيته، وألبسها ثوب الصحة والعافية عاجلاً غير آجل، وشافِنا وعافِنا واعف عنا، واشملنا بعطفك ومغفرتك، وتولّنا برحمتك يا أرحم الراحمين } .\n\n" +
                    "10- { إلهي أذهب البأس ربّ النّاس، اشف وأنت الشّافي، لا شفاء إلا شفاؤك، شفاءً لا يغادر سقماً، أذهب البأس ربّ النّاس، بيدك الشّفاء، لا كاشف له إلّا أنت يارب العالمين، اللهم إنّي أسألك من عظيم لطفك وكرمك وسترك الجميل، أن تشفيه وتمدّه بالصحّة والعافية، لا ملجأ ولا منجا منك إلّا إليك، إنّك على كلّ شيءٍ قدير } .\n\n" +
                    "11- { اللهمّ اشفه شفاءً ليس بعده سقماً أبداً، اللهمّ خذ بيده، اللهمّ احرسه بعينيك التّي لا تنام، واكفه بركنك الّذي لا يرام، واحفظه بعزّك الّذي لا يُضام، واكلأه في الّليل وفي النّهار، وارحمه بقدرتك عليه، أنت ثقته ورجاؤه، يا كاشف الهم، يا مُفرج الكرب، يا مُجيب دعوة المُضطرين } .\n\n" +
                    "12- { بسم الله أرقي نفسي من كلّ شيء يؤذيني، ومن شر كلّ نفس أو عين حاسد، بسم الله أرقي نفسي الله يشفيني، ما شاء الله كان، وما لم يشأ لم يكن، ولا حول ولا قوة إلّا بالله، أسأل الله العظيم رب العرش العظيم أن يشفيك ويشفي مرضى المسلمين } .\n\n" +
                    "13- { اللهم بعدد من سجد وشكر، نسألك أن تشفي كل مريض شفاءً لا يغادر سقماً، وتعوضهم خيراً عن كل لحظة وجع وألم، اللهم رد كل مريض إلى أهله سالماً معافاً من كل أذى أو ضر } .\n\n" +
                    "14- { يا مُفرّج الكرب يا مُجيب دعوة المُضطرين، اللهم ألبس كل مريض ثوب الصحة والعافية عاجلاً غير آجل يا أرحم الراحمين، اللهم اشفه، اللهم اشفه، اللهم اشفه، اللهم آمين } .\n\n" +
                    "15- اللهم نسألك بصفاتك العليا التي لا يقدر أحد على وصفها، وبأسمائك الحسنى التي لا يقدر أحد أن يحصيها، وأسألك بذاتك الجليلة ووجهك الكريم أن تشفي كل مريض، وتعافيه بحولك وقوتك } .\n\n" +
                    "16- { الحمد لله الّذي لا إله إلّا هو، وهو للحمد أهل وهو على كلّ شيءٍ قدير، وسبحان الله ولا إله إلّا الله والله أكبر، ولا حول ولا قوّة إلّا بالله } .\n\n" +
                    "17- { أعوذُ بكلماتِ اللهِ التاماتِ التي لا يُجاوزُهنَّ برٌّ ولا فاجرٌ من شرِّ ما خلق وذرأَ وبرأَ ومن شرِّ ما ينزلُ من السماءِ ومن شرِّ ما يعرجُ فيها ومن شرِّ ما ذرأ في الأرضِ ومن شرِّ ما يخرجُ منها ومن شرِّ فتَنِ الليلِ والنهارِ ومن شرِّ كلِّ طارقٍ إلّا طارقاً يطرقُ بخيرٍ يا رحمنُ } .\n\n" +
                    "18- { لا إله إلا الله الحليم الكريم، لا إله إلا الله العلي العظيم، لا إله الا الله رب السماوات السبع و رب العرش العظيم، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، الحمد لله الذي لا إله إلا هو، وهو للحمد أهل، وهو على كل شيء قدير، سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله، اللهم اشفه اللهم اشفه اللهم اشفه، اللّهم آمين } .\n\n" +
                    "19- { يا الله يا رحمن يا رحيم اللهم اكفه بركنك الذي لا يرام، واحفظه بعزك الذى لا يُضام، واكلأه فى الليل وفى النهار، وارحمه بقدرتك عليه، أنت ثقته ورجائه يا كاشف الهم، يا مفرّج الكرب، يا مجيب دعوة المضطرين } .\n\n" +
                    "20- { اللهم يا من تعيد المريض لصحته وتستجيب دعاء البائس، اللهمّ إنّا نسألك بكل اسمٍ لك أن تشفيه، اللهم إنا نسألك باسمك الشافي أن تعفو عنه وتشفيه، اللهم لا ملجأ ولا منجا منك إلا إليك إنك على كل شيء قدير } .\n\n" +
                    "21- { اللهم نسألك بصفاتك العليا التي لا يقدر أحد على وصفها، وبأسمائك الحسنى التي لا يقدر أحد أن يحصيها، وأسألك بذاتك الجليلة ووجهك الكريم أن تشفيه وتعافيه بحولك وقوتك يا أرحم الراحمين يا مجيب دعوة السائلين } .\n\n" +
                    "22- { اللهم يا مسهّل الشديد، ويا مليّن الحديد، ويا منجز الوعيد، أخرج مرضانا ومرضى المسلمين من حلق الضيق إلى أوسع الطريق، بك أدفع عن المسلمين ما لا يطيقون، ولا حول ولا قوة إلا بالله العلي العظيم } .\n\n" +
                    "23- { اللهم اشفه شفاءً ليس بعده سقم أبداً، اللهم خذ بيده، اللهمّ احرسه بعينك التي لا تنام، واكفه بركنك الذي لا يرام، واحفظه بعزك الذي لا يضام، واكلأه في الليل والنهار، وارحمه بقدرتك عليه، وارحمه بقدرتك عليه، أنت ثقته ورجاؤه، يا كاشف الهم، يا مفرج الكرب، يا مجيب دعوة المضطرين، اللهم ألبسه الصحة والعافية عاجلاً غير آجل، يا أرحم الراحمين، اللهم اشفه، اللهم اشفه، اللهم اشفه } .\n\n" +
                    "24- { شكا رجل إلى الرسول -صلى الله عليه وسلم- من ألمٍ في جسده؛ فقال له رسول الله: (ضَعْ يدَك على الَّذي تأْلَمُ مِن جسدِك وقُلْ: بسمِ اللهِ ثلاثًا وقُلْ سبْعَ مرَّاتٍ: أعوذُ باللهِ وقدرتِه مِن شرِّ ما أجِدُ وأُحاذِرُ) } .\n\n" +
                    "25- { اللهم اشفه شفاء ليس بعده سقم أبداً، اللهم خذ بيده، اللهم احرسه بعينك التي لا تنام، واكفه بركنك الذي لا يرام، واحفظه بعزك الذي لا يضام، في الليل وفي النهار، وارحمه بقدرتك عليه، أنت ثقته ورجائه يا كاشف الهم، يا مفرّج الكرب، يا مجيب دعوة المضطرين } .\n\n" +
                    "26- { اللهم بعدد من سجد وشكر، نسألك أن تشفي كل مريض شفاءً لا يغادر سقما، وتعوضهم خيراً عن كل لحظة وجع وألم، اللهم رد كل مريض إلى أهله سالما معافا من كل أذى أو ضر } .\n\n" +
                    "- عن سعيد الخدري وأبي هريرة، رضي الله عنهما، أنّهما شهدا على رسول الله صلّى الله عليه وسلم أنّه قال\u200F:\u200F \u200F”\u200Fمن قال\u200F:\u200F لا إله إلا الله والله اكبر، صدقه ربّه، فقال\u200F:\u200F لا إله إلّا أنا وأنا أكبر\u200F.\u200F وإذا قال\u200F:\u200F لا إله إلا الله وحده لا شريك له، قال\u200F:\u200F يقول\u200F:\u200F لا إله إلّا أنا وحدي لا شريك لي\u200F.\u200F وإذا قال\u200F:\u200F لا إله إلا الله له الملك وله الحمد، قال\u200F:\u200F لا إله إلّا أنا لي الملك ولي الحمد\u200F.\u200F وإذا قال\u200F:\u200F لا إله إلا الله ولا حول ولا قوّة إلا بالله، قال\u200F:\u200F لا إله إلّا أنا ولا حول ولا قوّة إلا بي\u200F”\u200F وكان يقول\u200F:\u200F \u200F”\u200Fمن قالها في مرضه ثمّ مات لم تطعمه النّار\u200F”\u200F.\n" +
                    "كانت هذه أجمل الأدعية من القرآن والسنة النبوية للشفاء من المرض، فاحرص أخي المسلم على ترديدها والدعاء بها لله." +
                    "\n\n\n")

            startActivity(int)
        }
        doaa_sad.setOnClickListener {
            int.putExtra("doaa","- الهم والحزن من المشاعر السيئة التي يتعرض لها كل البشر، وإذا أستلم الإنسان لهذه المشاعر السلبية فقد يعرض نفسه للمتاعب النفسية والجسدية التي لا حصر لها، لهذا على المؤمن القوي التوجه لله تعالى بالدعاء حتى تمر هذه الأحزان والهموم، لهذا فقد وفرنا لكم دعاء الهم والحزن والغم الذي يريح القلب ويشفي الفؤاد وعلى المؤمن أن يردد هذه الأدعية بشكل مستمر في السراء والضراء حتى يعينه الله ويقضي عنه هذا الهم .\n" +
                    "\n" +
                    "1- { لا إله إلا الله وحده لا شريك له العلي العظيم لا إله إلا الله وحده لا شريك له الحليم الكريم لا إله إلا الله وحده لا شريك له رب السماوات والأرض ورب العرش العظيم والصلاة والسلام على أشرف المرسلين سيدنا محمد عليه الصلاة والسلام } .\n\n" +
                    "2- { يا ودود يا ودود يا ذا العرش المجيد يا فعالا لما يريد اسالك بعزتك التي لا ترام وملكك الذي لا يضام وبنورك الذي ملأ اركان عرشك يا مغيث اغثني يا مغيث اغثني يا مغيث اغثني } .\n\n" +
                    "3- { يا لطيف، يا لطيف، يا لطيف، الطف بِي بلطفك الخفي، وأعني بقدرتك، اللهم إني أنتظر فرجك، وأرقب لُطفك، فالطف بي، ولا تكلني، إلى نفسي ولا إلى غيرك، لا إله إلا الله الرحمن الرحيم، اللهم إني أنزلتُ بك حاجتي كُلها، الظاهرة والباطنة } .\n\n" +
                    "4- { أدعوك يا إلهي دعاء من اشتدت به فاقته، وضعفت قوته، وقلت حيلته، دعاء الملهوف المكروب الذي لا يجد كشف ما نزل به إلا منك، فرج عني ما أهمني، وتولى أمري بلُطفك، وتداركني برحمتك وكرمك، إنك على كل شيء قدير } .\n\n" +
                    "5- { اللهم اكشف عني كل بلوى، يا عالِم كل خفية، يا صارف كل بليّة، أغثني، أدعوك دعاء من اشتدت به فاقته، وضعُفت قوته، وقلت حيلته، دعاء الغريق المضطر، اللهم ارحمني وأغثني، والطف بي، وتداركني بإغاثتك، اللهم بك ملاذي، اللهم أتوسل إليك باسمك الواحد، والفرد الصمد، وباسمك العظيم فرج عني ما أمسيت فيه، وأصبحت فيه، حتى لا يخامر خاطري وأوهامي غبار الخوف من غيرك، ولا يشغلني أثر الرجاء من سواك، أجرني، أجرني، أجرني، يا الله، اللهم يا كاشف الغم والهموم، ومفرج الكرب العظيم، ويا من إذا أراد شيئًا يقول له: كُن فيكون، رباه رباه أحاطت بي الذنوب والمعاصي، فلا أجد الرحمة والعناية من غيرك، فأمدني بها } .\n\n" +
                    "6- { يا ودود، يا ودود، يا ودود، يا ذا العرشِ المجيد، يا مُبدئ يا معيد، يا فعال لما يريد، أسألك بنور وجهك الذي ملأ أركان عرشك، وأسألك بقدرتك التي قدرت بها على جميع خلقك، وأسألك برحمتك التي وسعت كل شيء، لا إله إلا أنت، يا مُغيث أغثني } .\n\n" +
                    "7- { يا حي يا قيوم، يا نور يا قدوس، يا حي يا الله، يا رحمن اغفر لي الذنوب التي تحل النقم، واغفر لي الذنوب التي تُورث الندم، واغفر لي الذنوب التي تحبس القِسم، واغفر لي الذنوب التي تهتِك العِصم، واغفر لي الذنوب التي تقطع الرجاء، واغفر لي الذنوب التي تُعجّل الفناء، واغفر لي الذنوب التي ترد الدعاء، واغفر لي الذنوب التي تمسك غيث السماء، واغفر لي الذنوب التي تُظلم الهواء، واغفر لي الذنوب التي تكشِف الغِطاء، اللهم إني أسألك، يا فارج الهم، يا كاشف الغم، مجيب دعوة المضطر، رحمن الدنيا والآخرة ورحيمها، أسألك أن ترحمني برحمةٍ من عندك تُغنني بها عن رحمة من سواك } .\n\n" +
                    "8- { اللهم إن ضرورتنا قد حَفت، وليس لها إلا أنت، فاكشفها، يا مفرج الهموم، لا إله إلا أنت سبحانك، إني كنت من الظالمين، اللهم اكفني ما أهمني، اللهم يا حابس يد إبراهيم عن ذبح ابنه، يا رافع شأن يوسف على أخوته وأهله } .\n\n" +
                    "9- { يا من راح عبرة داود، وكاشف ضُر أيوب، يا مُجيب دعوة المضطرين، وكاشف غم المغمومين، أسألك أن تفرج همي، يا فارج الغم، اجعل لي من أمري فرجًا ومخرجًا، يا سامع كل شكوى، وكاشف كل كرب } .\n\n" +
                    "10- { اللهم إن ضرورتنا قد حَفت، وليس لها إلا أنت، فاكشفها، يا مفرج الهموم، لا إله إلا أنت سبحانك، إني كنت من الظالمين، اللهم اكفني ما أهمني، اللهم يا حابس يد إبراهيم عن ذبح ابنه، يا رافع شأن يوسف على أخوته وأهله } .\n\n" +
                    "11- { يا من راح عبرة داود، وكاشف ضُر أيوب، يا مُجيب دعوة المضطرين، وكاشف غم المغمومين، أسألك أن تفرج همي، يا فارج الغم، اجعل لي من أمري فرجًا ومخرجًا، يا سامع كل شكوى، وكاشف كل كرب } .\n\n" +
                    "12- { أغثني، أغثني، يا عزيز يا حميد، يا ذا العرش المجيد، اصرف عني شر كل جبار عنيد، اللهم إنك تعلم أنني على إساءتي وظلمي وإسرافي لم أجعل لك ولدًا ولا ندًا، ولا صاحبة ولا كفوًا أحد، فإن تُعذب فأنا عبدك، وإن تغفر فإنك العزيز الحكيم } .\n" +
                    "\n" +
                    "- (( دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ الْمَسْجِدَ فَإِذَا هُوَ بِرَجُلٍ مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو أمامه فَقَالَ: يَا أَبَا أمامه مَا لِي أَرَاكَ جَالِسًا فِي الْمَسْجِدِ فِي غَيْرِ وَقْتِ الصَّلَاةِ ؟ قَالَ: هُمُومٌ لَزِمَتْنِي، وَدُيُونٌ يَا رَسُولَ اللَّهِ، قَالَ: أَفَلَا أُعَلِّمُكَ كَلَامًا إِذَا أَنْتَ قُلْتَهُ أَذْهَبَ اللَّهُ عَزَّ وَجَلَّ هَمَّكَ، وَقَضَى عَنْكَ دَيْنَكَ ؟ " +
                    "\n" +
                    "قَالَ: قُلْتُ: بَلَى يَا رَسُولَ اللَّهِ، قَالَ: قُلْ إِذَا أَصْبَحْتَ، وَإِذَا أَمْسَيْتَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ، قَالَ: فَفَعَلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ عَزَّ وَجَلَّ هَمِّي، وَقَضَى عَنِّي دَيْنِي ))\n" +
                    "\n\n" )

            startActivity(int)
        }
        doaa_corona.setOnClickListener {
            int.putExtra("doaa", "- دعاء التحصين من كورونا و دعاء رفع البلاء و الامراض ، إن ادعية التحصين هي أكثر الأدعية التي يحتاجها الإنسان المسلم في هذه الايام فهي تقرب علاقة العبد بربه ، حيث ان دعاء التحصين من كورونا و الأمراض هو ما يهم ان يدعوه المسلمين في هذه الأوقات بعد تفشي فيروس كورونا كوفيد-19 في بلادنا العربية ، فالدعاء هي عبادة تقرب العبد الي ربه ، و قد أوصانا الأنبياء علي الدعاء . \n\n" +
                    "1- { اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأرْضِ وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بكَ مِن شَرِّ كُلِّ شيءٍ أَنْتَ آخِذٌ بنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فليسَ قَبْلَكَ شيءٌ، وَأَنْتَ الآخِرُ فليسَ بَعْدَكَ شيءٌ، وَأَنْتَ الظَّاهِرُ فليسَ فَوْقَكَ شيءٌ، وَأَنْتَ البَاطِنُ فليسَ دُونَكَ شيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ } .\n\n" +
                    "2- { اللهم اهدِني فيمن هديتَ، وعافني فيمن عافيتَ، وتولَّني فيمن تولَّيتَ، وبارِكْ لي فيما أعطيتَ، وقِني شرَّ ما قضيتَ، إنك تَقضي ولا يُقضَى عليك، إنه لا يَذِلُّ من والَيتَ، تباركْتَ وتعالَيْتَ } .\n" +
                    "\n" +
                    "3- { اللَّهُمَّ اغْفِرْ لي خَطِيئَتي وَجَهْلِي، وإسْرَافِي في أَمْرِي، وَما أَنْتَ أَعْلَمُ به مِنِّي، اللَّهُمَّ اغْفِرْ لي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذلكَ عِندِي، اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ علَى كُلِّ شيءٍ قَدِيرٌ } .\n" +
                    "\n" +
                    "4- { أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِن شَرِّ ما أَجِدُ وَأُحَاذِرُ } .\n" +
                    "\n" +
                    "5- { اللَّهُمَّ أَصْلِحْ لي دِينِي الذي هو عِصْمَةُ أَمْرِي، وَأَصْلِحْ لي دُنْيَايَ الَّتي فِيهَا معاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيهَا معادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لي مِن كُلِّ شَرٍّ } .\n" +
                    "\n" +
                    "6- { أَذْهِبِ البَاسَ، رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لا شِفَاءَ إلَّا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا } .\n" +
                    "\n" +
                    "7- { اللهمَّ عافِني في بدني، اللهمَّ عافِني في سمعي، اللهمَّ عافِني في بصري } .\n" +
                    "\n" +
                    "8- { أعوذُ باللَّهِ السَّميعِ العَليمِ مِنَ الشَّيطانِ الرَّجيمِ مِن هَمزِهِ، ونَفخِهِ ونَفثِهِ } .\n" +
                    "\n" +
                    "9- { أَعوذُ بكلِماتِ اللهِ التامَّاتِ، الَّتي لا يُجاوِزُهُنَّ بَرٌّ ولا فاجرٌ، مِن شرِّ ما خلقَ، وذرأَ، وبرأَ، ومِن شرِّ ما ينزِلُ مِن السَّماءِ، ومِن شرِّ ما يعرُجُ فيها، ومِن شرِّ ما ذرأَ في الأرضِ وبرأَ، ومِن شرِّ ما يَخرجُ مِنها، ومِن شرِّ فِتَنِ اللَّيلِ والنَّهارِ، ومِن شرِّ كلِّ طارقٍ يطرُقُ، إلَّا طارقًا يطرقُ بِخَيرٍ، يا رَحمنُ } .\n" +
                    "\n" +
                    "10- { أَعُوذُ بكَلِمَاتِ اللَّهِ التَّامَّةِ، مِن كُلِّ شيطَانٍ وهَامَّةٍ، ومِنْ كُلِّ عَيْنٍ لَامَّةٍ } .\n" +
                    "\n" +
                    "11- { اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لكَ مَمَاتُهَا وَمَحْيَاهَا، إنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وإنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إنِّي أَسْأَلُكَ العَافِيَة } .\n" +
                    "\n" +
                    "12- { هُوَ اللَّـهُ الَّذِي لَا إِلَـهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَـنُ الرَّحِيمُ* هُوَ اللَّـهُ الَّذِي لَا إِلَـهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّـهِ عَمَّا يُشْرِكُونَ* هُوَ اللَّـهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ } .\n" +
                    "\n" +
                    "13- { تحصنت بذي العزة، واعتصمت برب الملكوت، وتوكلت على الحي الذي لا يموت، اللهم اصرف عنا الوباء، بلطفك يا لطيف، إنك على كل شيء قدير } .\n" +
                    "\n" +
                    "14- { اللهم إني أعوذ بك مِنْ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئْ الْأَسْقَامِ } .\n" +
                    "\n" +
                    "15- التسبيح \n\n\n")

            startActivity(int)

        }

    }
} //end class
